{"command.restartServer":"Rëstært §ërvër","extension.description":"Tÿpë çhëçkïñg sµppørt før Pÿthøñ fïlës µsïñg Mÿpÿ.","settings.args.description":"Ærgµmëñts pæssëð tø Mÿpÿ tø ëñæþlë tÿpë çhëçkïñg øñ Pÿthøñ fïlës. Ëæçh ærgµmëñt shøµlð þë prøvïðëð æs æ sëpærætë strïñg ïñ thë ærræÿ. \n Ëxæmplë: \n `\"mÿpÿ-tÿpë-çhëçkër.ærgs\" : [\"--çøñfïg-fïlë=<fïlë>\"]`","settings.cwd.description":"§ëts thë çµrrëñt wørkïñg ðïrëçtørÿ µsëð tø lïñt Pÿthøñ fïlës wïth Mÿpÿ. ßÿ ðëfæµlt, ït µsës thë røøt ðïrëçtørÿ øf thë wørkspæçë `${wørkspæçëFølðër}`. Ýøµ çæñ sët ït tø `${fïlëÐïrñæmë}` tø µsë thë pærëñt følðër øf thë fïlë þëïñg lïñtëð æs thë wørkïñg ðïrëçtørÿ før Mÿpÿ. Ýøµ çæñ ælsø sët ït tø `${ñëærëstÇøñfïg}` tø µsë thë ñëærëst pærëñt/æñçëstør følðër whïçh çøñtæïñs æ `mÿpÿ.ïñï`, `.mÿpÿ.ïñï`, `pÿprøjëçt.tøml`, ør `sëtµp.çfg` fïlë.","settings.daemonStatusFile.description":"Pæth tø thë stætµs fïlë µsëð þÿ thë Mÿpÿ ðæëmøñ (`ðmÿpÿ`).","settings.ignorePatterns.description":"Çøñfïgµrë [gløþ pættërñs](https://ðøçs.pÿthøñ.ørg/3/lïþrærÿ/fñmætçh.html) æs sµppørtëð þÿ thë fñmætçh Pÿthøñ lïþrærÿ tø ëxçlµðë fïlës ør følðërs frøm þëïñg lïñtëð wïth Mÿpÿ.","settings.importStrategy.description":"Ðëfïñës whïçh Mÿpÿ þïñærÿ tø þë µsëð tø tÿpë çhëçk Pÿthøñ fïlës. Whëñ sët tø `µsëßµñðlëð`, thë ëxtëñsïøñ wïll µsë thë Mÿpÿ þïñærÿ thæt ïs shïppëð wïth thë ëxtëñsïøñ. Whëñ sët tø `frømËñvïrøñmëñt`, thë ëxtëñsïøñ wïll ættëmpt tø µsë thë Mÿpÿ þïñærÿ æñð æll ðëpëñðëñçïës thæt ærë ævæïlæþlë ïñ thë çµrrëñtlÿ sëlëçtëð ëñvïrøñmëñt. <þr> Ñøtë: Ïf thë ëxtëñsïøñ çæñ't fïñð æ vælïð Mÿpÿ þïñærÿ ïñ thë sëlëçtëð ëñvïrøñmëñt, ït wïll fællþæçk tø µsïñg thë Mÿpÿ þïñærÿ thæt ïs shïppëð wïth thë ëxtëñsïøñ. Thë `mÿpÿ-tÿpë-çhëçkër.pæth` sëttïñg tækës prëçëðëñçë æñð øvërrïðës thë þëhævïør øf `mÿpÿ-tÿpë-çhëçkër.ïmpørt§trætëgÿ`.","settings.importStrategy.fromEnvironment.description":"Üsë Mÿpÿ frøm thë sëlëçtëð ëñvïrøñmëñt. Ïf thë ëxtëñsïøñ fæïls tø fïñð æ vælïð Mÿpÿ þïñærÿ, ït wïll fællþæçk tø µsïñg thë þµñðlëð vërsïøñ øf Mÿpÿ.","settings.importStrategy.useBundled.description":"Ælwæÿs µsë thë þµñðlëð vërsïøñ øf Mÿpÿ shïppëð wïth thë ëxtëñsïøñ.","settings.interpreter.description":"Pæth tø æ Pÿthøñ ëxëçµtæþlë ør æ çømmæñð thæt wïll þë µsëð tø læµñçh thë Mÿpÿ sërvër æñð æñÿ sµþprøçëss. Æççëpts æñ ærræÿ øf æ sïñglë ør mµltïplë strïñgs. Whëñ sët tø `[]`, thë ëxtëñsïøñ wïll µsë thë pæth tø thë sëlëçtëð Pÿthøñ ïñtërprëtër. Ïf pæssïñg æ çømmæñð, ëæçh ærgµmëñt shøµlð þë prøvïðëð æs æ sëpærætë strïñg ïñ thë ærræÿ.","settings.path.description":"Pæth ør çømmæñð tø þë µsëð þÿ thë ëxtëñsïøñ tø tÿpë çhëçk Pÿthøñ fïlës wïth Mÿpÿ. Æççëpts æñ ærræÿ øf æ sïñglë ør mµltïplë strïñgs. Ïf pæssïñg æ çømmæñð, ëæçh ærgµmëñt shøµlð þë prøvïðëð æs æ sëpærætë strïñg ïñ thë ærræÿ. Ïf sët tø `[\"mÿpÿ\"]`, ït wïll µsë thë vërsïøñ øf Mÿpÿ ævæïlæþlë ïñ thë `PÆTH` ëñvïrøñmëñt værïæþlë. <þr> Ñøtë: Üsïñg thïs øptïøñ mæÿ sløwðøwñ tÿpë çhëçkïñg. \n Ëxæmplës: \n- `[\"~/gløþæl_ëñv/mÿpÿ\"]` \n- `[\"çøñðæ\", \"rµñ\", \"-ñ\", \"lïñt_ëñv\", \"pÿthøñ\", \"-m\", \"mÿpÿ\"]`","settings.preferDaemon.description":"Whëthër thë Mÿpÿ ðæëmøñ (`ðmÿpÿ`) wïll tækë prëçëðëñçë øvër `mÿpÿ`før tÿpë çhëçkïñg. <þr> Ñøtë: ïf `mÿpÿ-tÿpë-çhëçkër.rëpørtïñg§çøpë`ïs sët tø `wørkspæçë`, ëñæþlïñg thë Mÿpÿ ðæëmøñ wïll øffër æ fæstër tÿpë çhëçkïñg ëxpërïëñçë. Thïs sëttïñg wïll þë øvërrïððëñ ïf `mÿpÿ-tÿpë-çhëçkër.pæth`ïs sët.","settings.reportingScope.custom.description":"Prøþlëms ærë rëpørtëð før fïlës spëçïfïëð ïñ thë mÿpÿ çøñfïgµrætïøñ.","settings.reportingScope.description":"Çøñtrøls thë sçøpë øf Mÿpÿ's prøþlëm rëpørtïñg. Ïf sët tø `fïlë`, Mÿpÿ wïll lïmït ïts prøþlëm rëpørtïñg tø thë fïlës çµrrëñtlÿ øpëñ ïñ thë ëðïtør. Ïf sët tø `wørkspæçë`, Mÿpÿ wïll ëxtëñð ïts prøþlëm rëpørtïñg tø ïñçlµðë æll fïlës wïthïñ thë wørkspæçë. Ïf sët tø `çµstøm`, Mÿpÿ wïll øñlÿ rëpørt prøþlëms før fïlës spëçïfïëð ïñ thë Mÿpÿ çøñfïgµrætïøñ","settings.reportingScope.file.description":"Prøþlëms ærë rëpørtëð før thë fïlës øpëñ ïñ thë ëðïtør øñlÿ.","settings.reportingScope.workspace.description":"Prøþlëms ærë rëpørtëð før æll fïlës wïthïñ thë wørkspæçë.","settings.severity.description":"Mæppïñg øf Mÿpÿ's mëssægë tÿpës tø V§ Çøðë's ðïægñøstïç sëvërïtÿ lëvëls æs ðïsplæÿëð ïñ thë Prøþlëms wïñðøw. Ýøµ çæñ ælsø µsë ït tø øvërrïðë spëçïfïç Mÿpÿ ërrør çøðës. <þr>Før ëxæmplë: `{\"ërrør\": \"Ërrør\", \"ñøtë\": \"Ïñførmætïøñ\", \"ñæmë-ðëfïñëð\": \"Wærñïñg\" }`","settings.showNotifications.always.description":"§høw ñøtïfïçætïøñs før ërrørs æñð wærñïñgs.","settings.showNotifications.description":"Çøñtrøls whëñ ñøtïfïçætïøñs ærë shøwñ þÿ thïs ëxtëñsïøñ.","settings.showNotifications.off.description":"Ñëvër ðïsplæÿ æ ñøtïfïçætïøñ. Æñÿ ërrørs ør wærñïñg ærë stïll ævæïlæþlë ïñ thë løgs.","settings.showNotifications.onError.description":"§høw ñøtïfïçætïøñs før ërrørs.","settings.showNotifications.onWarning.description":"§høw ñøtïfïçætïøñs før ërrørs æñð wærñïñgs."}
