{"command.restartServer":"Sunucuyu Yeniden Başlat","extension.description":"Python dosyaları için Mypy kullanarak tür denetimi gerçekleştirme desteği.","settings.args.description":"Python dosyalarında tür denetimini etkinleştirmek için Mypy'ye geçirilen bağımsız değişkenler. Her bağımsız değişken dizide ayrı bir dize olarak sağlanmalıdır. \n Örnek: \n `\"mypy-type-checker.args\" : [\"--config-file=<file>\"]`","settings.cwd.description":"Mypy ile Python dosyalarına lint işlemi uygulamak için kullanılan geçerli çalışma dizinini ayarlar. Varsayılan olarak, '${workspaceFolder}' çalışma alanının kök dizinini kullanır. Lint işlemi uygulanmakta olan dosyanın üst klasörünü Mypy'nin çalışma dizini olarak kullanmak için, bunu `${fileDirname}` olarak ayarlayabilirsiniz. Ayrıca `mypy.ini`, `.mypy.ini`, `pyproject.toml`, or `setup.cfg` dosyası barındıran en yakın üst veya kök klasörü kullanmak için bunu `${nearestConfig}` olarak da ayarlayabilirsiniz.","settings.daemonStatusFile.description":"Mypy deamon programı (`dmypy`) tarafından kullanılan durum dosyasının yolu.","settings.ignorePatterns.description":"Dosya veya klasörlerin Mypy ile kaplanmasını engellemek için [glob desenlerini](https://docs.python.org/3/library/fnmatch.html) fnmatch Python kitaplığı tarafından desteklendiği şekilde yapılandırın.","settings.importStrategy.description":"Python dosyalarını kontrol etmek için kullanılacak Mypy ikili dosyasını belirtir. `useBundled` olarak ayarlandığında uzantı, uzantıyla birlikte gönderilen Mypy ikili dosyasını kullanır. `fromEnvironment` olarak ayarlandığında, uzantı Mypy ikili dosyasını ve şu anda seçili ortamda kullanılabilen tüm bağımlılıkları kullanmaya çalışılır. <br> Not: Uzantı seçili ortamda geçerli bir Mypy ikili dosyası bulamazsa, uzantıyla birlikte gönderilen Mypy ikili dosyasını kullanmaya geri döner. `mypy-type-checker.path` ayarı önceliklidir ve `mypy-type-checker.importStrategy` davranışını geçersiz kılar.","settings.importStrategy.fromEnvironment.description":"Seçili ortamdan Mypy kullanın. Uzantı geçerli bir Mypy ikili dosyası bulamazsa, Mypy'nin paketlenmiş sürümünü kullanmaya geri döner.","settings.importStrategy.useBundled.description":"Her zaman uzantıyla birlikte gönderilen Mypy'nin paketlenmiş sürümünü kullan.","settings.interpreter.description":"Mypy sunucusunu ve herhangi bir alt işlemi başlatmak için kullanılacak bir Python yürütülebilir dosyasının veya komutun yolu. Tek veya birden çok dizenin dizisini kabul eder. `[]` olarak ayarlandığında, uzantı seçili Python yorumlayıcısının yolunu kullanır. Komut geçiriliyorsa her bağımsız değişken dizide ayrı birer dize olarak sağlanmalıdır.","settings.path.description":"Mypy ile Python dosyalarında tür denetimi gerçekleştirmek için uzantı tarafından kullanılacak yol veya komut. Tek veya birden çok dizenin dizisini kabul eder. Komut geçiriliyorsa her bağımsız değişken dizide ayrı birer dize olarak sağlanmalıdır. Eğer `[\"mypy\"]` olarak ayarlanırsa, `PATH` ortam değişkeninde bulunan Mypy sürümünü kullanır. <br> Not: Bu seçeneğin kullanılması, tür denetimi işlemini yavaşlatabilir. \n Örnekler: \n- `[\"~/global_env/mypy\"]` \n- `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"mypy\"]`","settings.preferDaemon.description":"Mypy daemon programının (`dmypy`) tür denetimi için `mypy`ye göre öncelikli olup olmayacağı. <br> Not: `mypy-type-checker.reportingScope` `workspace` olarak ayarlanmışsa, Mypy arka plan programının etkinleştirilmesi daha hızlı bir tür kontrol deneyimi sunacaktır. Eğer `mypy-type-checker.path` ayarlanmışsa bu ayar geçersiz kılınır.","settings.reportingScope.custom.description":"Mypy yapılandırmasında belirtilen dosyalar için sorunlar rapor edilmektedir.","settings.reportingScope.description":"Mypy'nin sorun bildirme kapsamını denetler. Eğer `file` olarak ayarlanırsa, Mypy sorun bildirme kapsamını o anda düzenleyicide açık olan dosyalarla sınırlandırır. Eğer `workspace` olarak ayarlanırsa, Mypy sorun bildirme kapsamını çalışma alanındaki tüm dosyaları içerecek şekilde genişletir. `özel` olarak ayarlanırsa, Mypy yalnızca Mypy yapılandırmasında belirtilen dosyalar için sorunları raporlayacaktır","settings.reportingScope.file.description":"Yalnızca düzenleyicide açık olan dosyalar için sorunlar bildirilir.","settings.reportingScope.workspace.description":"Çalışma alanındaki tüm dosyalar için sorunlar bildirilir.","settings.severity.description":"Mypy'nin ileti türlerinin, Sorunlar penceresinde görüntülendiği şekilde VS Code'un tanılama önem düzeyleriyle eşlenmesi. Belirli Mypy hata kodlarını geçersiz kılmak için de bunu kullanabilirsiniz. <br>Örneğin: `{\"error\": \"Error\", \"note\": \"Information\", \"name-defined\": \"Warning\" }`","settings.showNotifications.always.description":"Hata ve uyarı bildirimlerini göster.","settings.showNotifications.description":"Bildirimlerin bu uzantı tarafından ne zaman gösterileceğini kontrol eder.","settings.showNotifications.off.description":"Hiçbir zaman bildirim görüntüleme. Tüm hatalar veya uyarılar günlüklerde kalır.","settings.showNotifications.onError.description":"Hatalar için bildirimleri göster.","settings.showNotifications.onWarning.description":"Hata ve uyarı bildirimlerini göster."}
